Revit 2020 API
Noise Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Noise
Visual Basic
Public NotInheritable Class Noise
Visual C++
public ref class Noise abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Noise
See Also
Noise Members
Autodesk.Revit.DB.Visual Namespace